Catalogs/СтатьиЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СтатьиЗатрат</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостояннаяЗатрата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет8Класса</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДекларацииПоНалогуНаПрибыль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделPL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыPL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатьиЗатрат/Ext/ObjectModule.bsl
Функция СчетПринадлежитРодителю(Счет, СчетРодитель) Экспорт
	
	Результат = Ложь;
	Если ТипЗнч(СчетРодитель) = Тип("Массив") Тогда
		Для каждого ИндСчетРодитель Из СчетРодитель Цикл
			Если Счет = ИндСчетРодитель ИЛИ Счет.ПринадлежитЭлементу(ИндСчетРодитель) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	Иначе	
		Если Счет = СчетРодитель ИЛИ Счет.ПринадлежитЭлементу(СчетРодитель) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка 
	   И НЕ ЭтоГруппа Тогда

		Если ВидЗатрат.Пустая() Тогда
			Сообщить(НСтр("ru='Укажите вид затрат!';uk='Вкажіть вид витрат!'"), СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если ХарактерЗатрат.Пустая() Тогда
			Сообщить(НСтр("ru='Укажите характер затрат!';uk='Вкажіть характер витрат!'"), СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Счет8Класса) Тогда
			Если БухгалтерскийУчет.ПолучитьИспользоватьКлассыСчетовВКачествеГрупп() Тогда
				мСчетЗатратыПоЭлементам 		= ПланыСчетов.Хозрасчетный.ЗатратыПоЭлементам;
			Иначе
				мСчетЗатратыПоЭлементам	= Новый Массив;
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.Амортизация);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты);
				мСчетЗатратыПоЭлементам.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам);
			КонецЕсли;
			
			Если НЕ СчетПринадлежитРодителю(Счет8Класса, мСчетЗатратыПоЭлементам) Тогда
				Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Счет %1 ""%2"" не является счетом 8-ого класса.';uk='Рахунок %1 ""%2"" не є рахунком 8-ого классу.'"), СокрЛП(Счет8Класса), Счет8Класса.Наименование));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
